[
  {
    "title": "What must you do when approaching a junction where the traffic light is green in your favour?",
    "answer": 1,
    "options": [
      "Open throttle to ride through the junction quickly",
      "Close throttle to slow down and be prepared to stop",
      "Maintain the same speed"
    ]
  },
  {
    "title": "At a junction, the traffic lights have changed to green in your favour. Elderly pedestrians are still crossing. You should:",
    "answer": 1,
    "options": [
      "rev your engine to attract their attention",
      "allow them more time to cross the road",
      "flash the high beam lights to attract their attention"
    ]
  },
  {
    "title": "Using the headlights while riding in heavy rain during daytime:",
    "answer": 0,
    "options": [
      "is recommended as you can be more easily seen by others",
      "is not advisable as it will shorten the battery lifespan",
      "is not recommended as the rain water will reflect the lights and distract the rider"
    ]
  },
  {
    "title": "Free-wheeling is dangerous because:",
    "answer": 1,
    "options": [
      "it can cause the motorbike to skid",
      "there is no engine braking",
      "the engine revolution will increase"
    ]
  },
  {
    "title": "While riding on a gradual bend, centrifugal force will cause your motorcycle to:",
    "answer": 1,
    "options": [
      "decelerate",
      "drift outwards",
      "drift inwards"
    ]
  },
  {
    "title": "Riding with a bald tyre is dangerous because:",
    "answer": 2,
    "options": [
      "it increases the chance of a skid",
      "it increases the chance of a puncture",
      "both A and B"
    ]
  },
  {
    "title": "After overtaking, you should:",
    "answer": 1,
    "options": [
      "return to the left lane immediately when you are ahead of the overtaken vehicle",
      "return to the left land when the overtaken vehicle appears in the left wing mirror",
      "continue to ride on the right lane"
    ]
  },
  {
    "title": "The engine brake is …………… when engaged at the third gear as compared to the second gear.",
    "answer": 2,
    "options": [
      "more effective",
      "just as effective",
      "less effective"
    ]
  },
  {
    "title": "You should utilise the engine brake when:",
    "answer": 0,
    "options": [
      "riding down a long steep slope",
      "riding up a steep hill",
      "riding on a level terrain"
    ]
  },
  {
    "title": "When riding towards the junction, riders should:",
    "answer": 0,
    "options": [
      "form up into the correct lane for the intended path of travel",
      "sound the horn to caution other road users",
      "accelerate to pass the junction quickly and prevent traffic congestion"
    ]
  },
  {
    "title": "When riding on the expressways, it is essential:",
    "answer": 1,
    "options": [
      "to use the lane with the least traffic",
      "to keep to the left lane unless overtaking",
      "to always ride on the road shoulder"
    ]
  },
  {
    "title": "The extreme right lane in the carriageway of an expressway is meant for:",
    "answer": 0,
    "options": [
      "emergency vehicles and overtaking purposes",
      "any vehicles travelling over the speed limit of the expressway",
      "any slow-moving vehicles"
    ]
  },
  {
    "title": "The brakes may malfunction after riding through floods. To correct this, you should:",
    "answer": 1,
    "options": [
      "ride up and stop on a slope to allow water to flow out from the brakes",
      "perform intermittent braking on both front and rear foot brakes and when stationary pump the brakes repeatedly in order to dry both brakes",
      "continue riding at normal speed to spin-dry both brakes"
    ]
  },
  {
    "title": "A safe gap of at least …………… must be observed and complied, when passing a broken-down vehicle.",
    "answer": 2,
    "options": [
      "0.3 metres",
      "0.5 metres",
      "1.0 metre"
    ]
  },
  {
    "title": "Upon hearing the siren of a fire engine, you should:",
    "answer": 1,
    "options": [
      "stop immediately where you are in order to give/make way",
      "pull over to the left or right side of the carriageway",
      "sound the horn to warn the front vehicles to fasten up"
    ]
  },
  {
    "title": "If you have …………… demerit points, you will not be allowed to apply for a provisional driving licence.",
    "answer": 2,
    "options": [
      "6",
      "9",
      "13"
    ]
  },
  {
    "title": "The two-second rule is applicable under …………… road conditions.",
    "answer": 1,
    "options": [
      "wet",
      "good",
      "sandy"
    ]
  },
  {
    "title": "After consuming alcoholic beverages:",
    "answer": 0,
    "options": [
      "your reaction time increases",
      "your reaction time will remain the same",
      "your reaction time will be reduced"
    ]
  },
  {
    "title": "In what way will alcohol affect you?",
    "answer": 0,
    "options": [
      "It reduces your ability to concentrate",
      "It increases your awareness of your surroundings",
      "It enables better coordination"
    ]
  },
  {
    "title": "A rider is not allowed to ride in the bus lane from …………… in the morning and …………… in the evening on weekdays (Mondays to Fridays).",
    "answer": 2,
    "options": [
      "7 am to 9 am and 4:30 pm to 8 pm",
      "7:30 am to 9:30 am and 5 pm to 8:30 pm",
      "7:30 am to 9:30 am and 5 pm to 8 pm"
    ]
  },
  {
    "title": "Your field of vision will be …………… when riding at 50 km/h as compared to when riding at 70 km/h.",
    "answer": 0,
    "options": [
      "greater",
      "unchanged",
      "smaller"
    ]
  },
  {
    "title": "When you notice a vehicle is trying to pull out between a row of stationary/parked vehicles, you should:",
    "answer": 2,
    "options": [
      "carry on regardless of danger ahead as you have the right of way",
      "sound the horn and accelerate",
      "slow down and be prepared to stop/give way"
    ]
  },
  {
    "title": "Whilst riding along a main road, you should:",
    "answer": 2,
    "options": [
      "stop at every junction before crossing",
      "accelerate through each junction",
      "check every side road before you ride past them"
    ]
  },
  {
    "title": "When riding behind a bus, you should:",
    "answer": 0,
    "options": [
      "maintain a greater following distance",
      "maintain a normal following distance",
      "position your motorcycle more to the right to have a better view"
    ]
  },
  {
    "title": "You should …………… before moving off.",
    "answer": 1,
    "options": [
      "consult mirrors and signal if necessary",
      "consult mirrors, check your blind spots and turn on the signal",
      "turn on the signal"
    ]
  },
  {
    "title": "Changing lanes abruptly will:",
    "answer": 1,
    "options": [
      "help improve the flow of traffic on the road",
      "cause inconvenience and danger to other road users",
      "cause wear and tear to the vehicle"
    ]
  },
  {
    "title": "The way to cool the engine is by having sufficient:",
    "answer": 1,
    "options": [
      "engine oil only",
      "water, air and engine oil",
      "air only"
    ]
  },
  {
    "title": "Why is it wrong to pull the clutch lever early to stop the motorcycle?",
    "answer": 2,
    "options": [
      "It can cause the engine to stall",
      "The motorcycle will skid",
      "The motorcycle will have no engine braking"
    ]
  },
  {
    "title": "To stop the motorcycle in an emergency, you should:",
    "answer": 0,
    "options": [
      "only apply both front and rear brakes",
      "apply both brakes and the clutch simultaneously",
      "apply the clutch first followed by both brakes"
    ]
  },
  {
    "title": "The distance travelled from the moment the hazard is seen to the time the brake is applied is known as the:",
    "answer": 2,
    "options": [
      "braking distance",
      "stopping distance",
      "reaction distance"
    ]
  },
  {
    "title": "Which of the following can cause the engine to stall?",
    "answer": 2,
    "options": [
      "Sudden release of the front brake lever",
      "Sudden release of the foot brake pedal",
      "Sudden release of the clutch lever"
    ]
  },
  {
    "title": "A motorcyclist can use the road shoulder of the expressway if:",
    "answer": 2,
    "options": [
      "the rider is overtaking another vehicle",
      "waiting and answering / making a phone call",
      "the motorcycle has broken down"
    ]
  },
  {
    "title": "Before entering the expressway, you should adjust your speed accordingly on the:",
    "answer": 2,
    "options": [
      "road shoulder",
      "deceleration lane",
      "acceleration lane"
    ]
  },
  {
    "title": "You are passing a stationary bus at the bus stop. You should:",
    "answer": 2,
    "options": [
      "sound the horn to warn the bus driver of your presence",
      "accelerate to overtake the bus before it starts to move off",
      "slow down and be ready to stop for pedestrians who may cross the road in front of the bus"
    ]
  },
  {
    "title": "The free play of the …………… should be between 10 mm to 20 mm.",
    "answer": 0,
    "options": [
      "clutch lever",
      "brake lever",
      "drive chain"
    ]
  },
  {
    "title": "Centrifugal force will push your motorcycle ……………, when you negotiate a sharp bend.",
    "answer": 1,
    "options": [
      "inwards",
      "outwards",
      "forward"
    ]
  },
  {
    "title": "The motorcycle helmet should always be worn with the strap fastened:",
    "answer": 2,
    "options": [
      "below the lower lip",
      "round the neck",
      "under the chin"
    ]
  },
  {
    "title": "Both knees should be …………… when you ride.",
    "answer": 2,
    "options": [
      "pointing outwards",
      "pointing inwards",
      "pressing lightly against the fuel tank"
    ]
  },
  {
    "title": "The motorcycle drive chain should not have a slack of more than:",
    "answer": 2,
    "options": [
      "40 mm",
      "30 mm",
      "20 mm"
    ]
  },
  {
    "title": "Riding with tyres that are …………… is illegal.",
    "answer": 2,
    "options": [
      "bought second-hand",
      "of different brands (front and rear differ)",
      "damaged or worn out"
    ]
  },
  {
    "title": "While braking, your motorcycle starts to skid. You should:",
    "answer": 1,
    "options": [
      "apply the brakes harder",
      "release the brakes and apply intermittent braking",
      "put the gear to neutral and apply the front brake"
    ]
  },
  {
    "title": "While overtaking a vehicle, it moves to the right to overtake another vehicle ahead. What should you do?",
    "answer": 2,
    "options": [
      "blast the horn to warn the driver",
      "flash the high beam",
      "abort overtaking and return to your lane"
    ]
  },
  {
    "title": "What should you do when the vehicle behind you tries to overtake you?",
    "answer": 2,
    "options": [
      "Accelerate to prevent the vehicle from overtaking you",
      "Ride normally",
      "Slow down if necessary and assist the driver to overtake you smoothly"
    ]
  },
  {
    "title": "A rider must reduce his/her speed:",
    "answer": 0,
    "options": [
      "before going round a bend",
      "whilst going round a bend",
      "after going round a bend"
    ]
  },
  {
    "title": "When riding downhill, you should be using:",
    "answer": 2,
    "options": [
      "the foot brake only",
      "the foot brake and front brake",
      "the foot brake and engine brake"
    ]
  },
  {
    "title": "Ensure that you are using the low beam when:",
    "answer": 0,
    "options": [
      "following another vehicle",
      "approaching a junction",
      "the battery is weak"
    ]
  },
  {
    "title": "When approaching a pedestrian crossing, you:",
    "answer": 0,
    "options": [
      "must not overtake over vehicles",
      "may overtake other vehicles if the other lanes are clear",
      "should overtake slow-moving and huge vehicles"
    ]
  },
  {
    "title": "When you are riding, the pillion rider should:",
    "answer": 1,
    "options": [
      "hold your shoulders",
      "place both hands around the waist",
      "leave his/her hands by the side"
    ]
  },
  {
    "title": "To bring the motorcycle to a stop during normal riding:",
    "answer": 2,
    "options": [
      "you should apply the front brake only",
      "you should apply the rear brake only",
      "you must apply both brakes simultaneously"
    ]
  },
  {
    "title": "The brake lever which is in front of the throttle controls the:",
    "answer": 0,
    "options": [
      "front wheel",
      "rear wheel",
      "both front and rear wheels"
    ]
  },
  {
    "title": "The right lane of a two-lane carriageway can be utilised when:",
    "answer": 0,
    "options": [
      "your path of travel is obstructed by road works or parked vehicles",
      "you are speeding",
      "the right lane is free from traffic"
    ]
  },
  {
    "title": "You are riding on the right lane. What should you do when a large vehicle on the left signals left but moves into your path?",
    "answer": 1,
    "options": [
      "tap the horn repeatedly to warn the driver of the inconvenience he has caused",
      "decelerate and keep a safe following distance",
      "overtake the large vehicle on the left"
    ]
  },
  {
    "title": "When you are approaching the zebra crossing:",
    "answer": 2,
    "options": [
      "accelerate to pass it quickly",
      "you may overtake the heavy vehicle",
      "stop behind the stop line only when there are pedestrians on the crossing or about to cross"
    ]
  },
  {
    "title": "You are approaching the green traffic light signal from a distance. You should:",
    "answer": 1,
    "options": [
      "accelerate to pass the junction quickly",
      "slow down and prepare to stop if the lights change to amber",
      "maintain throttle control and speed"
    ]
  },
  {
    "title": "When elderly pedestrians are still crossing the road after the “red man” signal comes on:",
    "answer": 1,
    "options": [
      "flash the high beam so they know that you have seen them",
      "slow down and be patient, allow them to cross at their own time",
      "tap the horn repeatedly in case they are hard of hearing"
    ]
  },
  {
    "title": "When being blinded by the headlights of oncoming traffic, you should:",
    "answer": 2,
    "options": [
      "turn on the high beam to retaliate",
      "shift your eyes to the right kerb/lane marker to use it as a guide",
      "shift your eyes to the left kerb/lane marker to use it as a guide"
    ]
  },
  {
    "title": "When approaching a sharp left bend at night, you should:",
    "answer": 0,
    "options": [
      "flash the high beam repeatedly, to attract the attention of other road users",
      "accelerate to pass the danger as quickly as possible",
      "position your vehicle more to the right of your lane to have a better view"
    ]
  },
  {
    "title": "Setting the gear to neutral or holding the clutch at “clutch-in mode” when cruising is also known as free-wheeling. Which of the following about free-wheeling is true?",
    "answer": 0,
    "options": [
      "At high speed, it takes a longer time and distance to stop",
      "At high speed, it will make it easier to negotiate a sharp bend",
      "An increase in mileage per litre and save petrol consumption"
    ]
  },
  {
    "title": "To manoeuvre smoothly around a sharp bend, you should reduce centrifugal force by:",
    "answer": 2,
    "options": [
      "maintaining the throttle speed",
      "accelerating before entering the bend",
      "decelerating before entering the bend"
    ]
  },
  {
    "title": "When a motorcycle is overtaking you, you should:",
    "answer": 1,
    "options": [
      "accelerate to prevent the rider from overtaking you",
      "slow down to assist the rider to overtake safely",
      "signal the rider to overtake on the left instead"
    ]
  },
  {
    "title": "Using the engine brake in third gear is:",
    "answer": 2,
    "options": [
      "more effective than in second gear",
      "the same as in second gear",
      "less effective than in second gear"
    ]
  },
  {
    "title": "While driving on a two-way street with two lanes in each direction, you should keep to:",
    "answer": 0,
    "options": [
      "the left lane",
      "the right lane",
      "either (a) or (b)"
    ]
  },
  {
    "title": "Which lane should you normally use when riding on a three-lane expressway?",
    "answer": 2,
    "options": [
      "Lane 1",
      "Lane 2",
      "Lane 3"
    ]
  },
  {
    "title": "Joe has missed the exit while riding on the expressway. He should:",
    "answer": 1,
    "options": [
      "slow down, filter to the road shoulder and proceed to the exit in the opposite direction",
      "carry on by riding to the next available exit",
      "reverse back to the exit"
    ]
  },
  {
    "title": "You should check …………… after riding through a flood.",
    "answer": 1,
    "options": [
      "all lightings and switches",
      "the brakes",
      "the tyres"
    ]
  },
  {
    "title": "There should be a gap of at least …………… when passing pedestrians that are facing traffic walking on tarmac.",
    "answer": 2,
    "options": [
      "0.5 metres",
      "1.5 metres",
      "1 metre"
    ]
  },
  {
    "title": "Upon hearing the siren of an emergency vehicle but unsure of its location, you should:",
    "answer": 1,
    "options": [
      "continue to ride at the same speed",
      "move to the side, slow down and stop if necessary",
      "accelerate so as not to obstruct the emergency vehicle"
    ]
  },
  {
    "title": "You will be barred from taking the riding test if you have obtained:",
    "answer": 0,
    "options": [
      "13 demerit points",
      "12 demerit points",
      "6 demerit points"
    ]
  },
  {
    "title": "Riding on a clear and open road in good weather conditions, the safe following distance between your motorcycle and the vehicle in front should be at least:",
    "answer": 2,
    "options": [
      "one car length",
      "three car lengths",
      "two-second time gap"
    ]
  },
  {
    "title": "A rider’s licence will be revoked if caught:",
    "answer": 0,
    "options": [
      "operating his/her vehicle with a blood alcohol concentration over 80 mg of alcohol / 100 ml of blood",
      "not obeying the STOP traffic sign",
      "not giving way to an ambulance with its siren on"
    ]
  },
  {
    "title": "Which statement is true regarding alcohol and riding?",
    "answer": 1,
    "options": [
      "After consuming alcohol, you can continue riding as long as you think that you are not drunk",
      "It is unsafe to ride your motorcycle after consuming alcohol",
      "Rest for 1 hour after having the last drink before it is safe to ride"
    ]
  },
  {
    "title": "What are the appropriate measures to be taken when you are approaching a stationary vehicle with a driver in it?",
    "answer": 1,
    "options": [
      "Tap the horn and accelerate quickly so as not to obstruct him/her",
      "Slow down, tap the horn if necessary because he/she may move out suddenly",
      "Continue with the same speed because it is his/her duty to check passing traffic"
    ]
  },
  {
    "title": "You should always ride:",
    "answer": 0,
    "options": [
      "in the centre or left of your lane",
      "as close to the centre line as possible",
      "on the centre white line in between two lanes"
    ]
  },
  {
    "title": "You are approaching a group of workers carrying out road works. You should:",
    "answer": 1,
    "options": [
      "speed up as you are approaching them",
      "slow down as you are approaching them",
      "continue riding at the speed limit of the road"
    ]
  },
  {
    "title": "You should not ride if:",
    "answer": 2,
    "options": [
      "it has rained for more than an hour",
      "it has rained for an hour",
      "it has just started raining less than 15 minutes ago"
    ]
  },
  {
    "title": "Free-wheeling …………… the stopping distance of a motorcycle.",
    "answer": 1,
    "options": [
      "decreases",
      "increases",
      "has no impact on"
    ]
  },
  {
    "title": "While riding, you spotted an oily patch on the road ahead. You should:",
    "answer": 0,
    "options": [
      "avoid it if possible",
      "speed up and quickly avoid",
      "reduce speed to ride over the oily patch"
    ]
  },
  {
    "title": "You are riding in heavy traffic and found it difficult to make a lane change. You should:",
    "answer": 0,
    "options": [
      "slow down and wait for someone to give way to you",
      "stop temporarily in your own lane and wait for an opportunity",
      "show your hand signal and move over immediately"
    ]
  },
  {
    "title": "Which of the below is the most vulnerable group:",
    "answer": 0,
    "options": [
      "cyclists, pedestrians and motorcyclists",
      "car drivers",
      "lorry drivers"
    ]
  },
  {
    "title": "The stopping distance on the wet road is longer as the …………… force is less:",
    "answer": 1,
    "options": [
      "centrifugal",
      "frictional",
      "kinetic"
    ]
  },
  {
    "title": "In broad daylight, why is it necessary for motorcyclists to switch on their motorcycle headlines to low beam (normal light)?",
    "answer": 1,
    "options": [
      "to improve the rider’s vision",
      "to be seen more easily by other road users",
      "to invite/communicate for others to proceed"
    ]
  },
  {
    "title": "Riding on the road shoulder is:",
    "answer": 1,
    "options": [
      "not an offence",
      "an offence with demerit points and compound fine",
      "not an offence during peak hours"
    ]
  },
  {
    "title": "You noticed that you are being tailgated by a vehicle. What should you do to prevent getting rear-ended?",
    "answer": 0,
    "options": [
      "move to the left and allow the vehicle at the rear to overtake",
      "ride faster so as not to cause inconvenience",
      "ignore the vehicle if you are travelling at the legal maximum speed"
    ]
  },
  {
    "title": "When you visit the doctor to get medication, you need to know that some medication can cause:",
    "answer": 0,
    "options": [
      "you to feel sleepy",
      "you to be more alert",
      "your reaction time to be reduced"
    ]
  },
  {
    "title": "The motorcyclist in the given scenario should …………… as the rider’s view is obstructed and the lorry needs a wider space on the left to complete the turn safely.",
    "answer": 2,
    "options": [
      "overtake the lorry",
      "sound the horn and proceed on",
      "slow down and stop if necessary to allow the lorry to complete the turn safely"
    ]
  },
  {
    "title": "You are riding on the right lane. The driver on the left lane is changing lane into your path of travel. You should:",
    "answer": 2,
    "options": [
      "sound the horn to warn that vehicle that you are in his blind spot",
      "speed up to make space for that vehicle and minimise inconvenience for both parties",
      "slow down to allow that vehicle to continue overtaking"
    ]
  },
  {
    "title": "Centrifugal force will cause your motorcycle …………… when negotiating a bend.",
    "answer": 1,
    "options": [
      "to slow down",
      "to swerve / drift outwards",
      "to swerve / drift inwards"
    ]
  },
  {
    "title": "The correct way to use the motorcycle helmet is to have the strap to be:",
    "answer": 1,
    "options": [
      "placed immediately below the lower lip",
      "properly fastened under the chin",
      "placed loosely under the chin to prevent suffocation"
    ]
  },
  {
    "title": "The reason to use PSB/SISR-approved type helmets is:",
    "answer": 1,
    "options": [
      "to look cool",
      "minimise head injuries",
      "to show that you are a skilful rider"
    ]
  },
  {
    "title": "The correct feet placement when riding is to point the feet:",
    "answer": 2,
    "options": [
      "outwards",
      "downwards",
      "straight forward"
    ]
  },
  {
    "title": "The front brake lever should have a free play between:",
    "answer": 1,
    "options": [
      "5 to 10 mm",
      "15 to 20 mm",
      "20 to 30 mm"
    ]
  },
  {
    "title": "Riding with under-inflated tyres can affect:",
    "answer": 1,
    "options": [
      "engine cooling system",
      "braking",
      "oil pressure"
    ]
  },
  {
    "title": "When the motorcycle skids due to heavy braking and locking of the wheels, you should:",
    "answer": 2,
    "options": [
      "turn the handle bar against the direction of the skid",
      "adopt the brake position",
      "release both brakes and then reapply again; turn the handle bar in the direction of the skid"
    ]
  },
  {
    "title": "You should …………… when you notice there is another motorcycle behind tailgating you.",
    "answer": 1,
    "options": [
      "accelerate to increase the following distance",
      "slow down, keep left and allow the rider to overtake",
      "maintain your speed and ignore the tailgater"
    ]
  },
  {
    "title": "When negotiating a sharp right bend, you should position your motorcycle:",
    "answer": 1,
    "options": [
      "more to the right of the road",
      "more to the left of the road",
      "in the centre of the road at all times"
    ]
  },
  {
    "title": "Jason is riding up the steep slope ahead. He should start to accelerate a little more:",
    "answer": 0,
    "options": [
      "just before going up the slope",
      "halfway on the slope",
      "when he is at the top of the slope"
    ]
  },
  {
    "title": "When you are blinded by the headlights of oncoming vehicles, you should:",
    "answer": 1,
    "options": [
      "increase your speed to get out from the glare zone",
      "slow down, apply intermittent brakes and stop if necessary",
      "stop immediately"
    ]
  },
  {
    "title": "If you have a pillion with you, ensure he/she sits:",
    "answer": 1,
    "options": [
      "as far from you as possible",
      "as close as possible to you",
      "comfortably slanting to one side"
    ]
  },
  {
    "title": "To stop your motorcycle smoothly, you should apply:",
    "answer": 2,
    "options": [
      "the front brakes only",
      "the rear brakes only",
      "both the front and rear brakes"
    ]
  },
  {
    "title": "The foot brake pedal that is situated on the right side of a motorcycle is for controlling the brakes of:",
    "answer": 0,
    "options": [
      "the rear wheel only",
      "both front and rear wheels",
      "the front wheel only"
    ]
  },
  {
    "title": "Peter is held up in heavy traffic, what should he do:",
    "answer": 2,
    "options": [
      "He should tailgate the vehicle in front",
      "He should lane change to the lane with less traffic",
      "He should stay put on his lane and follow the queue"
    ]
  },
  {
    "title": "When are you allowed to ride on the extreme right lane?",
    "answer": 2,
    "options": [
      "When you are riding at the same speed as the road speed limit",
      "When there are lesser vehicles on the extreme right lane",
      "When you are overtaking a slower vehicle"
    ]
  },
  {
    "title": "Ramu is riding towards a junction with the green light in his favour. What should he do next?",
    "answer": 1,
    "options": [
      "He should throttle up fast to bypass the junction",
      "He should release his throttle slowly and get ready to stop",
      "He should just maintain his speed"
    ]
  },
  {
    "title": "What should a rider do when the car in front of him is slowing down at the pedestrian crossing?",
    "answer": 1,
    "options": [
      "Use the horn and quickly overtake the car",
      "Ease off the throttle and get ready to stop",
      "Tailgate the front car closely"
    ]
  },
  {
    "title": "Aisyah is approaching a junction with an amber light flashing. What should she do?",
    "answer": 0,
    "options": [
      "She should ease off her throttle and only proceed when it is really safe",
      "She should throttle up fast and bypass the junction quickly in order to avoid the light changing",
      "She should come to a complete stop at the stop line and wait for the light to be in her favour"
    ]
  },
  {
    "title": "When a rider sees a pedestrian walking against the traffic flow, what should the distance between the rider and the pedestrian be?",
    "answer": 1,
    "options": [
      "2 metres",
      "1.5 metres",
      "1 metre"
    ]
  },
  {
    "title": "What should a rider do after passing through a flood?",
    "answer": 2,
    "options": [
      "Park the bike on the slope to let the water drain out from the brakes",
      "Speed up so that the brakes will dry up quickly",
      "Brake intermittently to dry the brakes"
    ]
  },
  {
    "title": "What should the extreme right lane on the expressway be used for?",
    "answer": 1,
    "options": [
      "Vehicles that are speeding",
      "Overtaking vehicles",
      "Vehicles that are travelling at the speed limit of the expressway"
    ]
  },
  {
    "title": "Which kind of riders can cause danger on the expressway?",
    "answer": 2,
    "options": [
      "A rider who doesn’t exceed the speed limit",
      "Drivers driving pickups and vans",
      "Riders who maintain a speed limit less than 40 km/h on the centre lane"
    ]
  },
  {
    "title": "Adrian is riding along a two-lane carriageway. He should:",
    "answer": 0,
    "options": [
      "ride on the left lane",
      "right on the right lane",
      "refrain from overtaking another vehicle"
    ]
  },
  {
    "title": "A lower gear:",
    "answer": 0,
    "options": [
      "has more power and less speed than a higher gear",
      "has more speed and less power than a higher gear",
      "has less power and lower speed than a higher gear"
    ]
  },
  {
    "title": "Ramu and Roger are riding in opposite directions on a slope which is very narrow. Which rider should give way first?",
    "answer": 1,
    "options": [
      "The rider going up the slope",
      "The rider going down the slope",
      "The rider riding a bike with a lower engine capacity"
    ]
  },
  {
    "title": "Siti is overtaking a car in front of her but the car suddenly sways into her lane. What should Siti do?",
    "answer": 0,
    "options": [
      "She should press her horn to alert the driver immediately",
      "She should show her hand gesture to alert the driver",
      "She should throttle up quickly to overtake the car"
    ]
  },
  {
    "title": "How often should the rider check the tyres?",
    "answer": 0,
    "options": [
      "Every day before riding the bike",
      "Every day at the petrol kiosk",
      "If the rider thinks it is necessary"
    ]
  },
  {
    "title": "What will happen if you speed up at a sharp bend?",
    "answer": 0,
    "options": [
      "You will be pushed outwards",
      "You will be pulled inwards",
      "You can control your bike much easier"
    ]
  },
  {
    "title": "On a rainy day, the stopping distance is …………… longer compared to dry weather.",
    "answer": 2,
    "options": [
      "4 times",
      "3 times",
      "2 times"
    ]
  },
  {
    "title": "What will free-wheeling do to your motorcycle?",
    "answer": 2,
    "options": [
      "It will stop suddenly",
      "It will go through a bend more easily",
      "Your motorcycle will go even faster than you wanted"
    ]
  },
  {
    "title": "A rider should switch on the high beam when he:",
    "answer": 2,
    "options": [
      "is riding on a bumpy road",
      "sees an oncoming car",
      "is riding on a road that is not brightly lit and is affecting his vision"
    ]
  },
  {
    "title": "Azel is riding along a road when she realises that a car is tailgating her closely. She should:",
    "answer": 0,
    "options": [
      "change lane to the left and allow the car to overtake her",
      "increase her speed so as not to obstruct the car behind",
      "continue riding in her lane and ignore the car"
    ]
  },
  {
    "title": "While riding, Lawrence realises that an ambulance is coming from the rear. What should he do next?",
    "answer": 1,
    "options": [
      "Reduce his speed",
      "Slow down and move to the side of the road",
      "Increase his speed"
    ]
  },
  {
    "title": "Josephine will not be able to book a riding test date if she accumulates:",
    "answer": 2,
    "options": [
      "10 demerit points",
      "12 demerit points",
      "13 demerit points"
    ]
  },
  {
    "title": "What will be the demerit points that will not allow a person to book a test date?",
    "answer": 2,
    "options": [
      "10",
      "12",
      "13"
    ]
  },
  {
    "title": "Roy consumed alcohol with his friends. He must not:",
    "answer": 0,
    "options": [
      "ride on his motorcycle",
      "ride his motorcycle fast on the road",
      "ride his motorcycle even after drinking coffee"
    ]
  },
  {
    "title": "What will happen to a rider if he is caught with a blood alcohol concentration of over 80 mg of alcohol per 100 ml of blood?",
    "answer": 1,
    "options": [
      "Pay a fine",
      "Charged in court",
      "Face a jail term"
    ]
  },
  {
    "title": "A traffic police officer who is directing the traffic flow overrules the following:",
    "answer": 2,
    "options": [
      "Road markings and road signs",
      "Traffic regulations and traffic light signals",
      "Both of the above"
    ]
  },
  {
    "title": "You are riding and a car hits you from the side. These types of accidents can take place at:",
    "answer": 2,
    "options": [
      "bends and straight courses of roads",
      "parking areas and roundabouts",
      "merging roads, carparks, roundabouts and intersections"
    ]
  },
  {
    "title": "Sam is riding along the road when he notices there is an oily patch on the road surface. He should:",
    "answer": 2,
    "options": [
      "release his throttle",
      "increase his speed",
      "avoid the oily patch if he can"
    ]
  },
  {
    "title": "Julie just rode on an expressway for a long time and is feeling tired. She should:",
    "answer": 0,
    "options": [
      "find a nearest exit and park her motorcycle at a carpark to rest",
      "stop at the road shoulder to rest",
      "slowly lane change to the left and ride slowly"
    ]
  },
  {
    "title": "Sam just consumed medicine which is causing him to be drowsy. He should:",
    "answer": 1,
    "options": [
      "ride only with a pillion on his motorcycle to guide him",
      "not ride at all as it is dangerous",
      "ride on minor roads only"
    ]
  },
  {
    "title": "What are precautionary measures you should do before moving off from the side of a kerb?",
    "answer": 0,
    "options": [
      "Signal your intention and check your blind spot to confirm safety",
      "Turn on your signal only",
      "Slowly move off before signalling"
    ]
  },
  {
    "title": "Can a rider wear a pair of slippers to ride?",
    "answer": 2,
    "options": [
      "Yes, as long as it makes him feel comfortable",
      "Yes, if he thinks it makes him shift the gear lever more easily",
      "No, because his feet might be caught in between the gear levers"
    ]
  },
  {
    "title": "What would be your action if you are approaching this lorry?",
    "answer": 0,
    "options": [
      "Reduce speed and get ready to stop",
      "Keep flashing your high beam to alert the lorry driver",
      "Proceed to your right side of the road"
    ]
  },
  {
    "title": "If a rider wants to mount a motorcycle, he should apply which brake?",
    "answer": 0,
    "options": [
      "Front brake",
      "Rear brake",
      "Both front and rear brakes"
    ]
  },
  {
    "title": "What should a rider do before starting the ignition of a motorcycle?",
    "answer": 1,
    "options": [
      "Kick down to first gear and apply the rear brake",
      "Ensure that his gear is in neutral",
      "Engage reverse gear"
    ]
  },
  {
    "title": "The purpose of the gear lever is:",
    "answer": 1,
    "options": [
      "to control the direction of travel",
      "to allow you to change the power of the motorcycle",
      "to increase and decrease the speed of the engine"
    ]
  },
  {
    "title": "The braking effect of the engine will be …………… at lower gears as compared to higher gears.",
    "answer": 0,
    "options": [
      "higher",
      "less power",
      "same as the above"
    ]
  },
  {
    "title": "What is the real reason for brake fade?",
    "answer": 0,
    "options": [
      "Overheating of the brakes",
      "There is air inside the brake fluid",
      "The brakes are out of adjustment"
    ]
  },
  {
    "title": "What should the car driver do if the motorcyclist suddenly comes towards the path of the car?",
    "answer": 0,
    "options": [
      "Reduce speed and keep left and prepare to stop if required",
      "Turn abruptly to the left and increase speed",
      "Stop completely"
    ]
  },
  {
    "title": "What should a rider do to reduce centrifugal force while negotiating a sharp bend?",
    "answer": 2,
    "options": [
      "Maintain his speed during the bend",
      "Increase his speed",
      "Reduce his speed"
    ]
  },
  {
    "title": "Wearing bright clothes while riding:",
    "answer": 1,
    "options": [
      "is required by law",
      "allows riders to be easily seen by other road users",
      "allows riders to look cool on the road"
    ]
  },
  {
    "title": "Wearing a visor or goggles while riding:",
    "answer": 0,
    "options": [
      "can protect a rider’s eyes from dust particles",
      "enables a rider to look cool",
      "allows a rider to see the road more clearly"
    ]
  },
  {
    "title": "As a rider, when you are riding, your knees should be:",
    "answer": 0,
    "options": [
      "pressing lightly against the fuel tank",
      "pointing slightly outwards",
      "just relaxed"
    ]
  },
  {
    "title": "What is the free play of the clutch lever?",
    "answer": 0,
    "options": [
      "10 to 20 mm",
      "5 to 10 mm",
      "0 to 5 mm"
    ]
  },
  {
    "title": "What would happen if a long vehicle makes a left turn?",
    "answer": 1,
    "options": [
      "It would make a sharp left turn",
      "It would go to the right side before turning left",
      "It would turn left and right before turning"
    ]
  },
  {
    "title": "A rider should shift to a lower gear:",
    "answer": 1,
    "options": [
      "as he is negotiating a bend",
      "before reaching the bend",
      "after riding past the bend"
    ]
  },
  {
    "title": "A rider should shift down to third or second gear:",
    "answer": 0,
    "options": [
      "as he is approaching the slope",
      "halfway through the slope",
      "once he reaches the top of the slope"
    ]
  },
  {
    "title": "A rider is approaching a cyclist who is carrying a heavy load on his bicycle. What should he do?",
    "answer": 2,
    "options": [
      "Ride as close as possible to the cyclist",
      "Do not overtake the cyclist",
      "Give the cyclist more space when bypassing"
    ]
  },
  {
    "title": "If a rider is carrying a pillion, when should he adjust his mirrors?",
    "answer": 0,
    "options": [
      "When both the rider and pillion are seated on the motorcycle",
      "When the motorcycle is still on the main stand",
      "When only the rider is on the motorcycle"
    ]
  },
  {
    "title": "How should a rider stop his motorcycle more effectively?",
    "answer": 0,
    "options": [
      "He should shift down to second gear",
      "He should stop in third gear",
      "He should shift up to fourth gear"
    ]
  },
  {
    "title": "Sam wants to release his motorcycle from the main stand. He should:",
    "answer": 0,
    "options": [
      "ensure the handlebar is straightened",
      "slightly tilt the handlebar to the right side",
      "shift the handlebar towards the left"
    ]
  },
  {
    "title": "To release the main stand, you should grip the handlebar with:",
    "answer": 2,
    "options": [
      "your left hand only",
      "your right hand only",
      "both hands"
    ]
  },
  {
    "title": "Road-hogging:",
    "answer": 1,
    "options": [
      "causes other vehicles to go slow",
      "causes other vehicles to overtake dangerously on the left",
      "causes other vehicles to overtake on the right"
    ]
  },
  {
    "title": "Sam wants to overtake a large container truck. He should keep a longer following distance because:",
    "answer": 1,
    "options": [
      "other vehicles can overtake him easily",
      "he can have a best view of the road in front",
      "the truck in front might roll backwards or stop suddenly"
    ]
  },
  {
    "title": "Raju is approaching a pedestrian crossing. The car in front of him is slowing down. What should Raju do?",
    "answer": 2,
    "options": [
      "Immediately overtake the car in front",
      "Continue to ride at the same speed",
      "Reduce speed and get ready to stop"
    ]
  },
  {
    "title": "What should a rider do when the traffic lights turn green in his favour?",
    "answer": 1,
    "options": [
      "Move off immediately",
      "Ensure safety from the right and left before proceeding",
      "Wait for the vehicle beside him to go first"
    ]
  },
  {
    "title": "A rider is following a car which is driven by an elderly driver. The rider should:",
    "answer": 1,
    "options": [
      "continuously flash his high beam to the driver and overtake immediately",
      "be cautious that the elderly driver’s reactions might be slow",
      "know that the elderly driver’s skill is very bad"
    ]
  },
  {
    "title": "Why must a rider dip the headlight while riding?",
    "answer": 2,
    "options": [
      "So that he can save the battery from spoiling",
      "So that he can see the road better",
      "So that he will not dazzle the drivers of oncoming vehicles"
    ]
  },
  {
    "title": "Raju is riding. He must …………… on a sharp bend, in order not to dazzle the oncoming traffic.",
    "answer": 1,
    "options": [
      "switch off his headlights",
      "dip his headlights",
      "turn on his high beam"
    ]
  },
  {
    "title": "What would happen if the neutral gear is engaged while riding?",
    "answer": 2,
    "options": [
      "The motorcycle will go through the bend smoothly.",
      "The rider will find it easier to control the motorcycle.",
      "The rider will find it hard to control the motorcycle."
    ]
  },
  {
    "title": "What would happen to a motorcycle’s stopping distance if the frictional force is reduced on a wet road?",
    "answer": 1,
    "options": [
      "The same",
      "Longer",
      "Shorter"
    ]
  },
  {
    "title": "James is riding towards a controlled junction with the green traffic lights in his favour, but there is an old man still crossing the road slowly. He must:",
    "answer": 1,
    "options": [
      "throttle up his engine to alert the old man",
      "be patient because they will take much longer to cross",
      "keep flashing the high beam to signal the old man to cross faster"
    ]
  },
  {
    "title": "If your motorcycle tyre pressure is incorrect, it may affect the:",
    "answer": 1,
    "options": [
      "engine oil pressure",
      "handlebar and braking effect",
      "gear shifting"
    ]
  },
  {
    "title": "What should a rider do in order to control his speed when going down a slope?",
    "answer": 1,
    "options": [
      "Use his front and rear brakes",
      "Engage a lower gear and use his foot brake",
      "Engage the neutral gear and use his foot brake"
    ]
  },
  {
    "title": "What is the difference between a higher gear and a lower gear?",
    "answer": 2,
    "options": [
      "Higher gear has more power and is for lower speed",
      "Higher gear has more power and is for higher speed",
      "Higher gear has lower power and higher speed"
    ]
  },
  {
    "title": "What may happen if a rider decides to lane-change abruptly?",
    "answer": 1,
    "options": [
      "Other road users will perceive the rider to have superior riding skills",
      "It can cause inconvenience and endanger other vehicles",
      "It will damage the motorcycle"
    ]
  },
  {
    "title": "How should a rider ride on the expressway?",
    "answer": 2,
    "options": [
      "Only overtake on the extreme left lane",
      "Ride in the extreme right lane if he is riding above the expressway speed limit",
      "Ride in the extreme left lane where possible"
    ]
  },
  {
    "title": "If there are no vehicles on the expressway, the rider should:",
    "answer": 0,
    "options": [
      "ride in the left lane",
      "ride in the extreme right lane",
      "ride in the centre lane"
    ]
  },
  {
    "title": "How should a rider ride the motorcycle through flood?",
    "answer": 1,
    "options": [
      "increase his/her speed and go through it fast",
      "ride through the flood in first gear",
      "ride through the flood in fifth gear"
    ]
  },
  {
    "title": "Peter realises that an ambulance is behind him with its siren on. What should he do?",
    "answer": 1,
    "options": [
      "Reduce his speed immediately",
      "Go to the side of the road and stop if necessary",
      "Increase his speed"
    ]
  },
  {
    "title": "A qualified rider who has more than one year of riding experience will be suspended from riding his motorcycle if he/she:",
    "answer": 1,
    "options": [
      "accumulates 12 demerit points within a year",
      "accumulates 24 demerit points within two years",
      "accumulates 36 demerit points within three years"
    ]
  },
  {
    "title": "Raju has been riding his motorcycle with a qualified licence for two years. He will be suspended if he accumulates:",
    "answer": 2,
    "options": [
      "12 demerit points within one year",
      "16 demerit points within one year",
      "24 demerit points within two years"
    ]
  },
  {
    "title": "A rider must look over their shoulder before making a turn because:",
    "answer": 1,
    "options": [
      "the rider needs to hear the sound of the traffic flows",
      "the rider needs to check traffic in the blind area",
      "the rider needs to look around in order to have a good balance of his bike"
    ]
  },
  {
    "title": "If you drink and ride:",
    "answer": 1,
    "options": [
      "you will be more confident in your ability to handle the motorcycle",
      "your ability to control the motorcycle will be reduced",
      "your awareness of traffic conditions will be increased"
    ]
  },
  {
    "title": "If a rider drinks and rides:",
    "answer": 0,
    "options": [
      "he will not be able to control the motorcycle",
      "he will be able to react to situations more quickly",
      "his/her reaction time will be faster"
    ]
  },
  {
    "title": "Simon has been caught riding his motorcycle with a blood alcohol that is beyond the legal limit. He will be:",
    "answer": 1,
    "options": [
      "given a heavy fine",
      "summoned to court for his offence and charged",
      "given a verbal warning"
    ]
  },
  {
    "title": "What is the danger that a rider at position X needs to anticipate in this situation shown?",
    "answer": 2,
    "options": [
      "the vehicle that is making a right turn",
      "the vehicle parked at the junction",
      "the cyclist that is about to cross the road"
    ]
  },
  {
    "title": "What is the real cause of brake fading?",
    "answer": 0,
    "options": [
      "burn out of the brakes",
      "air found in the brake oil",
      "brakes not in correct alignment"
    ]
  },
  {
    "title": "In order to stop traffic for children to cross, school wardens have to use:",
    "answer": 0,
    "options": [
      "a stop sign",
      "his own hands by stopping traffic",
      "his hand by indicating to the traffic that the children are waiting to cross"
    ]
  },
  {
    "title": "Where can a head-on collision occur?",
    "answer": 0,
    "options": [
      "on all roads",
      "only on a straight road",
      "when there is a bend and traffic junctions"
    ]
  },
  {
    "title": "James is riding behind a rider who is travelling slowly and he is not sure what the rider will do next. James should:",
    "answer": 2,
    "options": [
      "overtake the rider on the left",
      "overtake the rider on the right",
      "remain behind the rider"
    ]
  },
  {
    "title": "If you feel sleepy while riding:",
    "answer": 2,
    "options": [
      "you should ride in first gear",
      "increase speed to reach home faster",
      "exit the road and find a suitable place to rest"
    ]
  },
  {
    "title": "Which of the statements below states the appropriate action when the throttle fails to close?",
    "answer": 1,
    "options": [
      "return the choke to the original position",
      "switch on the cut-off button",
      "switch off the cut-off button"
    ]
  },
  {
    "title": "A rider on major roads should …………… when riding past minor roads on his/her left and right.",
    "answer": 2,
    "options": [
      "increase his speed",
      "maintain his speed",
      "release his throttle slowly to reduce his speed"
    ]
  },
  {
    "title": "When you visit the doctor to get medication, you need to know that some medication can cause:",
    "answer": 0,
    "options": [
      "you to feel sleepy",
      "you to be more alert",
      "your reaction time to be reduced"
    ]
  },
  {
    "title": "Your throttle is stuck while riding. You should:",
    "answer": 0,
    "options": [
      "immediately drop your gear, switch off the engine and press the brakes",
      "keep pressing your horn to alert other motorists",
      "keep trying to turn the throttle"
    ]
  },
  {
    "title": "Ethan is eight years old. Elvin is nine years old. Esther is ten years old. Who can be a pillion rider?",
    "answer": 2,
    "options": [
      "All three children",
      "Elvin and Esther only",
      "Esther only"
    ]
  },
  {
    "title": "If a rider is riding only on a half-clutch technique for a long duration:",
    "answer": 1,
    "options": [
      "damage the brakes linings",
      "damage the clutch linings",
      "the effectiveness of the engine brake may be reduced"
    ]
  },
  {
    "title": "When you are facing a rider who is riding with a probationary plate sign you should:",
    "answer": 1,
    "options": [
      "press the horn to alert them regarding your presence",
      "reduce your speed and be alert that the rider might be slow on his reaction on the road",
      "pick up speed and overtake as fast as possible"
    ]
  },
  {
    "title": "If you are taking a pillion, you should ask him/her to:",
    "answer": 0,
    "options": [
      "hold your waist during the journey",
      "hold your shoulder during the journey",
      "lean to the left while making a right turn"
    ]
  },
  {
    "title": "How should a rider maintain good lane discipline?",
    "answer": 0,
    "options": [
      "form up in the correct lane before reaching a junction",
      "ride in between lanes in order to lane change easily",
      "tailgate a vehicle closely"
    ]
  },
  {
    "title": "The centrifugal force acting on a motorcycle …………… if a rider increases speed while riding at bends.",
    "answer": 0,
    "options": [
      "will be greater",
      "will be lesser",
      "doesn’t have any effect on the rider"
    ]
  },
  {
    "title": "Dennis should put on his riding gloves when riding:",
    "answer": 1,
    "options": [
      "to enable his hands to stay warm",
      "to protect his hands",
      "to enable him to look good"
    ]
  },
  {
    "title": "Which of the below statements about wearing bright-coloured clothes is true?",
    "answer": 2,
    "options": [
      "required by law",
      "makes the rider feel comfortable",
      "enables other users to see them more easily"
    ]
  },
  {
    "title": "How should a rider put his feet on the footrest while riding?",
    "answer": 2,
    "options": [
      "heel on the footrest",
      "toes on the footrest",
      "arch of his feet on the footrest"
    ]
  },
  {
    "title": "When should a rider check his brake fluid?",
    "answer": 2,
    "options": [
      "when the rider realises that the brakes are not working",
      "when the rider wants to go for a long journey",
      "before riding his motorcycle"
    ]
  },
  {
    "title": "What should a rider do when his rear wheel is skidding to the right?",
    "answer": 1,
    "options": [
      "turn his handlebar in the opposite direction of the skid",
      "turn his handlebar in the direction of the skid",
      "turn the handlebar left then right"
    ]
  },
  {
    "title": "Raymond is approaching a sharp bend on his motorcycle. He should:",
    "answer": 2,
    "options": [
      "maintain his speed",
      "reduce his speed while negotiating the sharp bend",
      "reduce his speed before reaching the sharp bend"
    ]
  },
  {
    "title": "In wet weather conditions, a rider should maintain a …………… with the vehicle in front.",
    "answer": 1,
    "options": [
      "distance of four metres",
      "four-second time gap",
      "gap of four motorcycle lengths"
    ]
  },
  {
    "title": "After overtaking a lorry, the rider should:",
    "answer": 1,
    "options": [
      "return to the left lane immediately after passing the lorry",
      "return to the left lane when the lorry can be seen in the left wing mirror",
      "continue to ride on the right lane"
    ]
  },
  {
    "title": "What are the steps the rider should take before shifting his gear?",
    "answer": 1,
    "options": [
      "increase speed, clutch in fully and shift the gear",
      "release the throttle fully, press the clutch lever and shift the gear",
      "shift the gear without pressing the clutch"
    ]
  },
  {
    "title": "When using a helmet, the strap must be placed around the:",
    "answer": 2,
    "options": [
      "nose",
      "mouth",
      "chin"
    ]
  },
  {
    "title": "To prevent rain or dirt entering the eyes, the rider needs to be equipped with:",
    "answer": 2,
    "options": [
      "helmet visor",
      "a pair of motorcycle goggles",
      "options A and B"
    ]
  },
  {
    "title": "It is advisable to wear …………… clothes to ride so that other road users can see you easily.",
    "answer": 0,
    "options": [
      "bright colour",
      "dark colour",
      "winter"
    ]
  },
  {
    "title": "If a rider does not wear an approved helmet, the penalty is:",
    "answer": 2,
    "options": [
      "3 demerit points only",
      "a compound fine",
      "both 3 demerit points and a compound fine"
    ]
  },
  {
    "title": "When riding, it is essential to be:",
    "answer": 0,
    "options": [
      "wearing covered shoes with laces tucked in properly",
      "wearing slippers/sandals",
      "bare-footed"
    ]
  },
  {
    "title": "The free play of the brake lever and brake pedal should be between:",
    "answer": 0,
    "options": [
      "15 to 20 mm",
      "20 to 25 mm",
      "25 to 30 mm"
    ]
  },
  {
    "title": "The free play of the clutch lever should be between:",
    "answer": 0,
    "options": [
      "10 to 20 mm",
      "21 to 30 mm",
      "31 to 40 mm"
    ]
  },
  {
    "title": "The free play of the drive chain should be between:",
    "answer": 0,
    "options": [
      "15 to 20 mm",
      "21 to 25 mm",
      "26 to 30 mm"
    ]
  },
  {
    "title": "The tyre tread depth of a motorcycle should be not less than:",
    "answer": 0,
    "options": [
      "1.6 mm",
      "16 mm",
      "0.16 mm"
    ]
  },
  {
    "title": "What is the minimum insurance coverage that you can purchase for your motorcycle?",
    "answer": 1,
    "options": [
      "Comprehensive",
      "Third party cover",
      "Third party cover and fire & theft"
    ]
  },
  {
    "title": "What is the correct sitting posture for safe riding?",
    "answer": 2,
    "options": [
      "You should be leaning forward with your shoulders raised, or to bend your shoulders and back into a rounded shape",
      "When riding in standard position, the ankles are in line with the elbows",
      "The rider is sitting with their back upright and shoulders should be stacked above your hips and slightly pushed back"
    ]
  },
  {
    "title": "The pillion rider should:",
    "answer": 0,
    "options": [
      "sit as close as possible to the rider holding the rider’s waist",
      "sit as close as possible to the rider holding the rider’s shoulder",
      "sit as far as possible to the rider holding the rider’s shoulder"
    ]
  },
  {
    "title": "With a pillion, the centre of gravity on the front wheel during braking will be …………… as compared to without a pillion.",
    "answer": 0,
    "options": [
      "greater",
      "lesser",
      "the same"
    ]
  },
  {
    "title": "With a pillion, the braking distance will be …………… as compared to without a pillion.",
    "answer": 1,
    "options": [
      "shorter",
      "longer",
      "the same"
    ]
  },
  {
    "title": "Losing concentration and increased reaction time can be caused by:",
    "answer": 2,
    "options": [
      "fatigue",
      "distraction",
      "both A & B"
    ]
  },
  {
    "title": "Rider must signal at least …………… before changing path of travel.",
    "answer": 2,
    "options": [
      "10 seconds",
      "5 seconds",
      "3 seconds"
    ]
  },
  {
    "title": "When checking blind spots, riders should turn their head and look:",
    "answer": 0,
    "options": [
      "over their shoulder",
      "into the mirrors",
      "behind their back"
    ]
  },
  {
    "title": "Blind spots should be checked before:",
    "answer": 2,
    "options": [
      "turning left or right",
      "moving off, stopping, lane departure",
      "both A & B"
    ]
  },
  {
    "title": "Free-wheeling is caused by:",
    "answer": 2,
    "options": [
      "setting the gear to neutral while coming to a stop",
      "pulling and holding the clutch lever too early",
      "both A & B"
    ]
  },
  {
    "title": "Which gear provides the most torque?",
    "answer": 2,
    "options": [
      "Fifth gear",
      "Third gear",
      "First gear"
    ]
  },
  {
    "title": "The rider requires less braking effort and shorter braking distance when:",
    "answer": 0,
    "options": [
      "riding in second gear",
      "riding in fourth gear",
      "riding in fifth gear"
    ]
  },
  {
    "title": "A bus has stopped at the bus stop. You should:",
    "answer": 2,
    "options": [
      "increase your speed to overtake the bus before it leaves the bus stop",
      "sound your horn to alert pedestrians in front of the bus",
      "slow down in anticipation that pedestrians may cross the road in front of the bus"
    ]
  },
  {
    "title": "When going down a steep slope, the rider should:",
    "answer": 1,
    "options": [
      "depress the clutch and apply the engine brake to ride down the slope smoothly",
      "apply engine braking together with the footbrake",
      "apply the footbrake only"
    ]
  },
  {
    "title": "By applying intermittent braking, riders will be able to prevent:",
    "answer": 2,
    "options": [
      "skidding",
      "a rear collision",
      "both A & B"
    ]
  },
  {
    "title": "To warn tailgaters, simply apply the …………… technique",
    "answer": 1,
    "options": [
      "emergency brake",
      "intermittent brake",
      "engine brake"
    ]
  },
  {
    "title": "Which of the below statements about the brakes is true?",
    "answer": 0,
    "options": [
      "The front brake is more effective than the rear brake",
      "The front brake is less effective than the rear brake",
      "The front brake is of the same effectiveness as the rear brake"
    ]
  },
  {
    "title": "While being overtaken, a rider should:",
    "answer": 0,
    "options": [
      "close throttle and slow down to assist the overtaking vehicle to overtake",
      "speed up so as not to cause inconvenience",
      "horn to warn him/her to stay behind"
    ]
  },
  {
    "title": "While riding, how often must you move your eyes?",
    "answer": 2,
    "options": [
      "Every 6 to 10 seconds",
      "Every 4 to 5 seconds",
      "Every 2 to 3 seconds"
    ]
  },
  {
    "title": "When passing a stationary bus at the bus stop, you should:",
    "answer": 2,
    "options": [
      "speed up as the bus may be moving off soon causing delay to you",
      "horn to alert the bus driver and other motorists",
      "slow down and be ready to stop for pedestrians who may cross in front of the bus"
    ]
  },
  {
    "title": "A few vehicles have stopped before a zebra crossing. What should you do?",
    "answer": 1,
    "options": [
      "Lane split to the front so that you can see better and be ahead of everyone else",
      "Slow down, be ready to stop and queue",
      "Sound the horn to warn pedestrians that you are approaching"
    ]
  },
  {
    "title": "When passing a pedestrian walking on the pavement against traffic flow, we should keep a gap of:",
    "answer": 0,
    "options": [
      "1 m",
      "1.5 m",
      "2 m"
    ]
  },
  {
    "title": "When passing parked vehicles, riders must keep a gap of:",
    "answer": 1,
    "options": [
      "0.5 m",
      "1 m",
      "1.5 m"
    ]
  },
  {
    "title": "While passing moving vehicles, riders should keep a distance of:",
    "answer": 2,
    "options": [
      "1 m",
      "2 m",
      "1.5 m"
    ]
  },
  {
    "title": "A large vehicle is slowing down and moving right to turn to the left. The rider should:",
    "answer": 2,
    "options": [
      "overtake the large vehicle on the right",
      "overtake the large vehicle on the left",
      "slow down and be prepared to stop if necessary"
    ]
  },
  {
    "title": "When a rider hears the siren of an emergency vehicle, he/she should:",
    "answer": 2,
    "options": [
      "apply intermittent braking to warn all vehicles at the rear",
      "stop immediately",
      "give way by pulling over to the left or right side of the road"
    ]
  },
  {
    "title": "The minimum age to ride as a pillion is …………… years old",
    "answer": 1,
    "options": [
      "6",
      "10",
      "12"
    ]
  },
  {
    "title": "When negotiating a bend, pillion should:",
    "answer": 1,
    "options": [
      "lean in the opposite direction as the rider",
      "lean in the same direction as the rider",
      "maintain an upright position"
    ]
  },
  {
    "title": "A rider should ride through a flood using the:",
    "answer": 0,
    "options": [
      "first gear",
      "third gear",
      "fifth gear"
    ]
  },
  {
    "title": "It is advisable to stop and wait for …………… minutes after it starts to rain before continuing to ride again.",
    "answer": 2,
    "options": [
      "1",
      "5",
      "15"
    ]
  },
  {
    "title": "What does the term “road-hogging” refer to?",
    "answer": 2,
    "options": [
      "changing lanes frequently and unnecessarily",
      "riding in between two lanes",
      "riding at an unreasonably slow speed on the right lane"
    ]
  },
  {
    "title": "After passing through floods, the brakes become ineffective, the rider should:",
    "answer": 1,
    "options": [
      "park the motorcycle in the hot sun to dry the brakes",
      "apply intermittent braking to dry the brakes",
      "apply engine braking to dry the brake system"
    ]
  },
  {
    "title": "When stopping upslope, the rider should apply …………… to prevent rolling backwards",
    "answer": 1,
    "options": [
      "the front brake followed by the rear brake",
      "the rear brake followed by the front brake",
      "both the front and rear simultaneously"
    ]
  },
  {
    "title": "In order to counter gravitational force when riding up a slope, the rider should be:",
    "answer": 0,
    "options": [
      "leaning forward",
      "leaning backwards",
      "seated upright"
    ]
  },
  {
    "title": "In order to counter gravitational force when riding downslope, the rider should be:",
    "answer": 1,
    "options": [
      "leaning forward",
      "leaning backwards",
      "seated upright"
    ]
  },
  {
    "title": "When a rider encounters an oily patch on the road, the best course of action is:",
    "answer": 2,
    "options": [
      "slow down and ride over it",
      "accelerate to ride over it as quickly as possible",
      "avoid if possible"
    ]
  },
  {
    "title": "Painted road markings can be slippery when wet. Riders should take extra care when:",
    "answer": 2,
    "options": [
      "braking",
      "turning",
      "both A & B"
    ]
  },
  {
    "title": "Stopping on a downslope, the rider should use the …………… brake to prevent rolling forward.",
    "answer": 1,
    "options": [
      "front",
      "rear",
      "both front and rear"
    ]
  },
  {
    "title": "While riding at night, a rider is approaching a right bend where visibility is low. The rider should:",
    "answer": 0,
    "options": [
      "switch on the high beam to attract the attention of other road users",
      "sound the horn to alert other road users",
      "ride more on the right of the lane to have a better view of the road"
    ]
  },
  {
    "title": "When blinded by the headlights of oncoming vehicles, you should look to the:",
    "answer": 0,
    "options": [
      "left and use the kerb/lane markings as your guide",
      "right and use the lane markings as your guide",
      "front"
    ]
  },
  {
    "title": "While riding round the bend and the rear tyre skidded towards the right, the rider should:",
    "answer": 0,
    "options": [
      "hold the handle firmly and turn it to the right",
      "hold the handle firmly and turn it to the left",
      "hold the handle firmly and hold it at the straight position"
    ]
  }
]